configuration/src/ChartsOfCharacteristicTypes/QuestionsForSurvey/QuestionsForSurvey.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>QuestionsForSurvey</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.QuestionnaireAnswersOptions</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Wording</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyType</name>
    <type>
      <types>EnumRef.TypesOfAnswersToQuestion</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentNote</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutoFill</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MinValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MaxValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accuracy</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowAggregatedValuesInReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RadioButtonType</name>
    <type>
      <types>EnumRef.RadioButtonTypesInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckBoxType</name>
    <type>
      <types>EnumRef.CheckBoxKindsInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMinValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMaxValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowRangeSlider</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RangeSliderStep</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowHintForNumericalQuestions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>NumericalQuestionHintsRange</name>
    <attributes>
      <name>ValueUpTo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ToolTip</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Enums/RadioButtonTypesInQuestionnaires/RadioButtonTypesInQuestionnaires.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RadioButtonTypesInQuestionnaires</name>
  <enumValues>
    <name>RadioButton</name>
  </enumValues>
  <enumValues>
    <name>Tumbler</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/CheckBoxKindsInQuestionnaires/CheckBoxKindsInQuestionnaires.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CheckBoxKindsInQuestionnaires</name>
  <enumValues>
    <name>InputField</name>
  </enumValues>
  <enumValues>
    <name>CheckBox</name>
  </enumValues>
</mdclass:Enum>

configuration/src/ChartsOfCharacteristicTypes/QuestionsForSurvey/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.BatchEditObjects

// Returns object attributes that can be edited using the bulk attribute modification data processor.
// 
//
// Returns:
//  Array of String
//
Function AttributesToEditInBatchProcessing() Export
	
	Result = New Array;
	Return Result;
	
EndFunction

// End StandardSubsystems.BatchEditObjects

#EndRegion

#EndRegion

#Region Internal

////////////////////////////////////////////////////////////////////////////////
// Update handlers.

// Registers the objects to be updated in the InfobaseUpdate exchange plan.
// 
//
Procedure RegisterDataToProcessForMigrationToNewVersion(Parameters) Export
	
	Query = New Query;
	Query.Text =
		"SELECT
		|	QuestionsForSurvey.Ref AS Ref
		|FROM
		|	ChartOfCharacteristicTypes.QuestionsForSurvey AS QuestionsForSurvey
		|WHERE
		|	(QuestionsForSurvey.RadioButtonType = VALUE(Enum.RadioButtonTypesInQuestionnaires.EmptyRef)
		|			OR QuestionsForSurvey.CheckBoxType = VALUE(Enum.CheckBoxKindsInQuestionnaires.EmptyRef)
		|			OR QuestionsForSurvey.MinValue <> 0
		|				AND NOT QuestionsForSurvey.ShouldUseMinValue
		|			OR QuestionsForSurvey.MaxValue <> 0
		|				AND NOT QuestionsForSurvey.ShouldUseMaxValue)
		|	AND NOT QuestionsForSurvey.IsFolder";
	
	Result = Query.Execute().Unload();
	ReferencesArrray = Result.UnloadColumn("Ref");
	
	InfobaseUpdate.MarkForProcessing(Parameters, ReferencesArrray);
	
EndProcedure

// Fill in a value of the new RadioButtonType attribute for the the QuestionsForSurvey chart of characteristic types.
// 
Procedure ProcessDataForMigrationToNewVersion(Parameters) Export
	
	Selection = InfobaseUpdate.SelectRefsToProcess(Parameters.Queue, "ChartOfCharacteristicTypes.QuestionsForSurvey");
	ObjectsWithIssuesCount = 0;
	ObjectsProcessed = 0;
	
	While Selection.Next() Do
		RepresentationOfTheReference = String(Selection.Ref);
		Try
			
			FillNewAttributes(Selection.Ref);
			ObjectsProcessed = ObjectsProcessed + 1;

		Except
			ObjectsWithIssuesCount = ObjectsWithIssuesCount + 1;
			MessageText = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Couldn''t process the question for survey %1 due to:
					|%2';"), 
				RepresentationOfTheReference, ErrorProcessing.DetailErrorDescription(ErrorInfo()));
			WriteLogEvent(InfobaseUpdate.EventLogEvent(), EventLogLevel.Warning,
				Metadata.ChartsOfCharacteristicTypes.QuestionsForSurvey, Selection.Ref, MessageText);
		EndTry;
		
	EndDo;
	
	Parameters.ProcessingCompleted = InfobaseUpdate.DataProcessingCompleted(Parameters.Queue, "ChartOfCharacteristicTypes.QuestionsForSurvey");

	If ObjectsProcessed = 0 And ObjectsWithIssuesCount <> 0 Then
		MessageText = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Couldn''t process (skipped) some survey questions: %1';"), 
				ObjectsWithIssuesCount);
		Raise MessageText;
	Else
		WriteLogEvent(InfobaseUpdate.EventLogEvent(), EventLogLevel.Information,
			Metadata.ChartsOfCharacteristicTypes.QuestionsForSurvey,,
				StringFunctionsClientServer.SubstituteParametersToString(
					NStr("en = 'Another batch of survey questions is processed: %1';"),
					ObjectsProcessed));
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// Fills in values of the new RadioButtonType and CheckBoxType attributes for the passed object.
//   
// Parameters:
//   QuestionForSurvey - ChartOfCharacteristicTypesRef.QuestionsForSurvey 
//
Procedure FillNewAttributes(QuestionForSurvey)
	
	BeginTransaction();
	Try
	
		Block = New DataLock;
		LockItem = Block.Add("ChartOfCharacteristicTypes.QuestionsForSurvey");
		LockItem.SetValue("Ref", QuestionForSurvey);
		Block.Lock();
		
		Object = QuestionForSurvey.GetObject();
		
		If Object.RadioButtonType = Enums.RadioButtonTypesInQuestionnaires.EmptyRef() Then
			Object.RadioButtonType = Enums.RadioButtonTypesInQuestionnaires.RadioButton;
		EndIf;
		
		If Object.CheckBoxType = Enums.CheckBoxKindsInQuestionnaires.EmptyRef() Then
			Object.CheckBoxType = Enums.CheckBoxKindsInQuestionnaires.CheckBox;
		EndIf;    
			
		If ValueIsFilled(Object.MinValue) Then
			Object.ShouldUseMinValue = True;
		EndIf;
		
		If ValueIsFilled(Object.MaxValue) Then
			Object.ShouldUseMaxValue = True;
		EndIf;
		
		InfobaseUpdate.WriteData(Object);
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure
	
#EndRegion

#EndIf
